#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_PartModifier_Backpack_M_CatBurglar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Athena_PartModifier_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_PartModifier_Backpack_M_CatBurglar.B_Athena_PartModifier_Backpack_M_CatBurglar_C
// 0x0058 (0x05A0 - 0x0548)
class AB_Athena_PartModifier_Backpack_M_CatBurglar_C final : public AB_Athena_PartModifier_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Athena_PartModifier_Backpack_M_CatBurglar_C; // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   LastPawn;                                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAthenaItemWrapDefinition> WeaponWrapToUse;                                 // 0x0558(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SL_LastValue;                                      // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SL_RefreshTimeHandler;                             // 0x0588(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_StartLevel;                                     // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_EndLevel;                                       // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndRadius;                                         // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyLevelParam(int32 Level);
	void ApplyOverrideToItems(TArray<class UFortItem*>& Array);
	void ExecuteUbergraph_B_Athena_PartModifier_Backpack_M_CatBurglar(int32 EntryPoint);
	void GetAssociatedAthenaController(class AFortPlayerControllerAthena** AsFort_Player_Controller_Athena);
	void HackyWorkaroundRefreshTimerGuy();
	void InitializeVariabels();
	void OnActualStatChange();
	void OnPawnAndPartChanged();
	void OnPostResIn();
	void OnStatChanged_ADEC84754D9C14E63858F5A170B97A58(class FName StatName, int32 StatValue);
	void ResetSafetyGate();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_PartModifier_Backpack_M_CatBurglar_C">();
	}
	static class AB_Athena_PartModifier_Backpack_M_CatBurglar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_PartModifier_Backpack_M_CatBurglar_C>();
	}
};
static_assert(alignof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C) == 0x000008, "Wrong alignment on AB_Athena_PartModifier_Backpack_M_CatBurglar_C");
static_assert(sizeof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C) == 0x0005A0, "Wrong size on AB_Athena_PartModifier_Backpack_M_CatBurglar_C");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, UberGraphFrame_B_Athena_PartModifier_Backpack_M_CatBurglar_C) == 0x000548, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::UberGraphFrame_B_Athena_PartModifier_Backpack_M_CatBurglar_C' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, LastPawn) == 0x000550, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::LastPawn' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, WeaponWrapToUse) == 0x000558, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::WeaponWrapToUse' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, SL_LastValue) == 0x000580, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::SL_LastValue' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, SL_RefreshTimeHandler) == 0x000588, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::SL_RefreshTimeHandler' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, SL_StartLevel) == 0x000590, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::SL_StartLevel' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, SL_EndLevel) == 0x000594, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::SL_EndLevel' has a wrong offset!");
static_assert(offsetof(AB_Athena_PartModifier_Backpack_M_CatBurglar_C, EndRadius) == 0x000598, "Member 'AB_Athena_PartModifier_Backpack_M_CatBurglar_C::EndRadius' has a wrong offset!");

}

