#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Earpiece_Gadget_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Earpiece_Gadget_AnimBP.Earpiece_Gadget_AnimBP_C
// 0x0100 (0x0450 - 0x0350)
class UEarpiece_Gadget_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0388(0x00C0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Earpiece_Gadget_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Earpiece_Gadget_AnimBP_C">();
	}
	static class UEarpiece_Gadget_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEarpiece_Gadget_AnimBP_C>();
	}
};
static_assert(alignof(UEarpiece_Gadget_AnimBP_C) == 0x000010, "Wrong alignment on UEarpiece_Gadget_AnimBP_C");
static_assert(sizeof(UEarpiece_Gadget_AnimBP_C) == 0x000450, "Wrong size on UEarpiece_Gadget_AnimBP_C");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, UberGraphFrame) == 0x000350, "Member 'UEarpiece_Gadget_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UEarpiece_Gadget_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UEarpiece_Gadget_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'UEarpiece_Gadget_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000388, "Member 'UEarpiece_Gadget_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

