#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Cat_Burglar_AnimBP

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Cat_Burglar_AnimBP.M_MED_Cat_Burglar_AnimBP_C
// 0x8AD0 (0x9150 - 0x0680)
class UM_MED_Cat_Burglar_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0698(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06B8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x0838(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0940(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0A48(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0B50(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C58(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C78(0x0020)()
	uint8                                         Pad_C98[0x8];                                      // 0x0C98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_25;                     // 0x0CA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_24;                     // 0x11B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_23;                     // 0x16C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_22;                     // 0x1BD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0x20E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0x25F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0x2B00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x3010(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x3520(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x3A30(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x3F40(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x4450(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x4960(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x4E70(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x5380(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x5890(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x5DA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x62B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x67C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x6CD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x71E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x76F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x7C00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x8110(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x8620(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x8B30(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x9040(0x0108)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_M_MED_Cat_Burglar_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Cat_Burglar_AnimBP_C">();
	}
	static class UM_MED_Cat_Burglar_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Cat_Burglar_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Cat_Burglar_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Cat_Burglar_AnimBP_C");
static_assert(sizeof(UM_MED_Cat_Burglar_AnimBP_C) == 0x009150, "Wrong size on UM_MED_Cat_Burglar_AnimBP_C");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, UberGraphFrame) == 0x000680, "Member 'UM_MED_Cat_Burglar_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Root) == 0x000698, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006B8, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Constraint_4) == 0x000838, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000940, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000A48, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Constraint_1) == 0x000B50, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C58, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000C78, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_25) == 0x000CA0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_25' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_24) == 0x0011B0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_24' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_23) == 0x0016C0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_23' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_22) == 0x001BD0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_22' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_21) == 0x0020E0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_21' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_20) == 0x0025F0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_20' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_19) == 0x002B00, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_18) == 0x003010, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_17) == 0x003520, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_16) == 0x003A30, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_15) == 0x003F40, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_14) == 0x004450, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_13) == 0x004960, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_12) == 0x004E70, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_11) == 0x005380, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x005890, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x005DA0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x0062B0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x0067C0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x006CD0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x0071E0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x0076F0, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x007C00, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x008110, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x008620, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x008B30, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_AnimBP_C, AnimGraphNode_Constraint) == 0x009040, "Member 'UM_MED_Cat_Burglar_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");

}

