#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Cat_Burglar_Human_FaceAcc_AnimBP

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Cat_Burglar_Human_FaceAcc_AnimBP.M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C
// 0x2A80 (0x3100 - 0x0680)
class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0698(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06B8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x0840(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0D50(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x1260(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1770(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1C80(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2190(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x21B0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x21D0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x26E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2BF0(0x0510)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_M_MED_Cat_Burglar_Human_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x003100, "Wrong size on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000680, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000698, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006B8, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x000840, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000D50, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x001260, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001770, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001C80, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002190, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0021B0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0021D0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0026E0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002BF0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

